import re


class Subjects:
    # Constants with subjects and their grade levels
    SUBJECTS_AND_GRADES = {
        "Чистописание": (1, 1),
        "Чтение": (1, 4),
        "Труд": (1, 4),
        "Природоведение": (1, 5),
        "Математика": (1, 6),
        "Музыка": (1, 8),
        "ИЗО": (1, 11),
        "Разговоры о важном": (1, 11),
        "Русский язык": (1, 11),
        "Родной язык": (1, 11),
        "Родная литература": (1, 11),
        "Физкультура": (1, 11),
        "Классный час": (1, 11),
        "Иностранный язык": (4, 11),
        "История": (5, 11),
        "Литература": (5, 11),
        "ОБЖ": (5, 11),
        "Технология": (5, 11),
        "География": (6, 10),
        "Биология": (6, 11),
        "Информатика": (5, 11),
        "Обществознание": (6, 11),
        "Черчение": (8, 9),
        "Алгебра": (7, 11),
        "Геометрия": (7, 11),
        "Физика": (7, 11),
        "Химия": (8, 11),
        "Естествознание": (10, 11),
        "Основы экономики": (10, 11),
        "Правоведение": (10, 11),
        "Философия": (10, 11),
        "Экология": (10, 11),
        "Астрономия": (11, 11),
        "НВП": (11, 11),
    }

    SUBJECTS_NAMES = {
        "Чистописание": ["Чистописание", "Чистопис", "Чистоп", "Чисто"],
        "Чтение": ["Чтение", "Чтен"],
        "Труд": ["Труд", "Труды"],
        "Природоведение": ["Природоведение", "Природоведен", "Природовед", "Природа", "Природ"],
        "Математика": ["Математика", "Математике", "Матика", "Матека", "Матеша", "Мат"],
        "Музыка": ["Музыка", "Музыке", "Музык", "Муз"],
        "ИЗО": ["ИЗО"],
        "Русский язык": ["Русский язык", "Русский яз", "Русский", "Русскому", "Русс яз", "Рус яз", "Рус"],
        "Физкультура": ["Физкультура", "Физкультуре", "Физкульт", "Физ-ра", "Физра"],
        "Разговоры о важном": ["Разговоры о важном", "Разговоры о важ", "о важном", "Разговоры", "Разг о важ", "Разг о важ", "о важ", "Разг"],
        "Родной язык": ["Родной язык", "Родной яз", "Родной", "Родн яз", "Род яз", "Родн", "Род"],
        "Родная литература": ["Родная литература", "Родная литер", "Родная лит-ра", "Родная литра", "Родная лит",
                              "Родная", "Род литература", "Род литер", "Род лит-ра", "Род литра", "Род лит", "Род"],
        "Классный час": ["Классный час", "Классный ч", "Классный", "Классн час", "Классн ч", "Классн", 
                         "Клас час", "Клас ч", "Клас", "Кл час", "Кл ч", "Кл"],
        "Иностранный язык": ["Иностранный язык", "Иностранный яз", "Иностранный", "Ин язык", "Ин яз", "Ин", 
                             "Английский язык", "Английский яз", "Англ язык", "Анг язык", "Англ яз", "Анг яз", 
                             "Английский", "Англ", "Анг"],
        "История": ["История", "Истории", "Истор", "Ист"],
        "Литература": ["Литература", "Литературе", "Литер", "Лит-ра", "Литра", "Литре", "Лит"],
        "ОБЖ": ["ОБЖ"],
        "Технология": ["Технология", "Технологии", "Технолог", "Технол", "Техна", "Тех"],
        "География": ["География", "Географии", "Географ", "Геогр", "Геог", "Гео"],
        "Биология": ["Биология", "Биологии", "Биолог", "Биол", "Био"],
        "Информатика": ["Информатика", "Информатике", "Информатик", "Информат", "Инфо", "Инфа"],
        "Обществознание": ["Обществознание", "Обществознанию", "Общество", "Общест", "Общага", "Общ"],
        "Черчение": ["Черчение", "Черчению", "Черчен", "Черче", "Черч", "Чёрт", "Черт"],
        "Алгебра": ["Алгебра", "Алгебре", "Албебра", "Бебра", "Алг", "Алг-ра", "Алгра"],
        "Геометрия": ["Геометрия", "Геометрии", "Геометр", "Геомет", "Геом"],
        "Физика": ["Физика", "Физике", "Физ"],
        "Химия": ["Химия", "Химии", "Хим"],
        "Естествознание": ["Естествознание", "Естествознанию", "Естествозн", "Естество", "Естест", "Ест"],
        "Основы экономики": ["Основы экономики", "Основы эконом", "Основы эко", "Основы эк", "Осн экономики", "Осн эконом", "Осн эко", "Осн эк", "Основы", "Осн"],
        "Правоведение": ["Правоведение", "Правоведен", "Правовед", "Право", "Прав"],
        "Философия": ["Философия", "Фигософия", "Философ", "Филос", "Фил"],
        "Экология": ["Экология", "Экологии", "Эколог", "Экол", "Эко"],
        "Астрономия": ["Астрономия", "Астрономии", "Астроном", "Астроно", "Астро", "Астр", "Аст"],
        "НВП": ["НВП"],
    }

    @classmethod
    async def get_subjects_for_grade(cls, grade: int) -> list[str]:
        subjects_for_grade: list[str] = []

        # Iterate through the subjects in the constant and check their grades
        for subject, (grade_from, grade_to) in cls.SUBJECTS_AND_GRADES.items():
            if grade >= grade_from and grade <= grade_to:
                subjects_for_grade.append(subject)

        return subjects_for_grade
    
    @classmethod
    async def get_subjects_from_text(cls, text: str, one_line: bool = True) -> str:
        """Возвращает все написанные предметы в первой строке текста."""
        if not text: return
        result = []
        s = text.lower().split("\n")[0] if one_line else text.lower()
        formatted_text = re.sub('[!@#$-.,]', '', s)
        line = formatted_text.split()

        for subject, subject_names in cls.SUBJECTS_NAMES.items():
            for subject_name in subject_names:
                words_in_subject_name = subject_name.split()
                if len(words_in_subject_name) == 1:
                    if subject_name.lower() in line:
                        result.append(subject)
                else:
                    # Если слов в subject_name больше одного.
                    word_number_in_subject_name = 0
                    for word in line:
                        if word_number_in_subject_name == len(words_in_subject_name):
                            result.append(subject)
                            break
                        word_of_subject_name = words_in_subject_name[word_number_in_subject_name]
                        if word.lower() == word_of_subject_name.lower():
                            word_number_in_subject_name += 1
        
        all_subjects_in_text = list( set(result) )

        return all_subjects_in_text
    
    @classmethod
    async def get_subject_from_text(cls, text: str) -> str:
        """Возвращает первый найденный предметы в тексте."""
        result = await cls.get_subjects_from_text(text, False)
        return result[0] if result else None